[
  {
    "category": "UI",
    "description": "Add smooth zoom animations to images on hover in the gallery (export cards and detail page)",
    "details": "Add transform: scale() CSS transitions to images in export-card.tsx and addon-detail-page.tsx. Use Tailwind's hover:scale-105 or hover:scale-110 for subtle zoom effect. Duration: ~300-500ms with ease-out timing to match existing transitions. Respect prefers-reduced-motion for accessibility. Ensure zoom doesn't interfere with existing carousel auto-pause functionality. Apply overflow-hidden to parent containers to prevent zoomed images from breaking layout.",
    "steps": [
      "Hovering over images in export cards shows smooth zoom animation",
      "Hovering over images in detail page carousel shows smooth zoom animation",
      "Zoom animation stops when prefers-reduced-motion is enabled",
      "Carousel auto-pause functionality still works correctly",
      "No layout shift or overflow issues when images zoom",
      "Zoom animation completes smoothly when quickly moving mouse on/off images"
    ],
    "passes": "cancelled"
  },
  {
    "category": "UI",
    "description": "Emphasize Copy button as primary action on addon detail page",
    "details": "Reorder action buttons to place Copy button first (left-most). Update button styling hierarchy: Copy button uses prominent default variant (potentially size='lg'), Download stays ghost variant, 'Get from source' changes to outline/secondary variant. This establishes clear visual hierarchy with Copy as primary action. May need to check/update CopyButton component to accept variant and size props.",
    "steps": [
      "Copy button appears first (left-most) in button group",
      "Copy button is visually most prominent (default variant styling)",
      "Download button remains subtle (ghost variant)",
      "Get from source button is less prominent than Copy (outline/secondary variant)",
      "Layout works responsively on mobile (flex-wrap maintains order)",
      "Button hierarchy is clear at a glance"
    ],
    "passes": true
  },
  {
    "category": "Infrastructure",
    "description": "Extend AddonExport type to support media items (images and videos) with metadata",
    "details": "Replace images?: string[] with media?: MediaItem[] where MediaItem = { type: 'image' | 'video', url: string }. Keep images as deprecated for backward compatibility. Type system ensures videos are properly identified and rendered differently from images.",
    "steps": [
      "Update src/types/exports.ts with new MediaItem type and media field",
      "Mark images as deprecated with JSDoc comment",
      "Ensure backward compatibility by handling both images and media arrays"
    ],
    "passes": true
  },
  {
    "category": "UI",
    "description": "Create video player component with autoplay, loop, mute, and no controls",
    "details": "Build <MediaCarouselItem> or similar component that renders <video> tags with autoplay, loop, muted, playsInline attributes and no controls. Falls back to <img> for image items. Handles prefers-reduced-motion by pausing autoplay/loop. Lazy loads videos similar to images.",
    "steps": [
      "Create video rendering component with required attributes (autoplay, loop, muted, playsInline)",
      "Remove video player UI controls (controlsList=\"nodownload nofullscreen noremoteplayback\")",
      "Respect prefers-reduced-motion accessibility preference",
      "Implement lazy loading for video elements",
      "Test video playback in carousel"
    ],
    "passes": false
  },
  {
    "category": "Feature",
    "description": "Integrate videos in export card and detail page carousels",
    "details": "Modify export-card.tsx and addon-detail-page.tsx to iterate over media array (with images fallback). Render videos with autoplay carousel behavior. Modal view supports video playback. Videos pause when not visible/active in carousel. Ensure smooth transitions between image and video slides.",
    "steps": [
      "Update export-card.tsx to handle media items (images + videos)",
      "Update addon-detail-page.tsx carousel to support video playback",
      "Ensure videos pause when carousel advances to different slide",
      "Test modal functionality with video media items",
      "Verify smooth transitions between mixed image/video content",
      "Confirm carousel auto-pause still works correctly"
    ],
    "passes": false
  },
  {
    "category": "Infrastructure",
    "description": "Fix timestamp update scripts to properly update lastUpdated when ANY export data changes, not just exportString",
    "details": "Current script only updates timestamps when exportString field changes, but many exports don't have exportString (only name, description, downloadUrl, images, tags, etc.). Script needs to: 1) Detect ANY content change - Compare entire export object (excluding lastUpdated itself) between current file and git HEAD. 2) Support manual force update - --all flag should force update all timestamps to NOW regardless of changes. 3) Support selective update - --force file1.ts file2.ts to manually update specific files. 4) Better change detection - Parse TS/JS exports properly instead of regex, or compare git diff for any change outside lastUpdated field. 5) Handle new files - Files not in git HEAD should get current timestamp. 6) Preserve behavior - Still integrate with git pre-commit hook workflow.",
    "steps": [
      "Script detects changes to ANY field (description, images, tags, downloadUrl, setupInstructions, exportString, etc.)",
      "bun run update-timestamps updates only modified staged files with actual content changes",
      "bun run update-timestamps --all force updates ALL files to current timestamp regardless of changes",
      "bun run update-timestamps --force file1.ts file2.ts updates specific files",
      "New export files (not in git) get current timestamp",
      "Changes to only lastUpdated field don't trigger infinite update loops",
      "Script works correctly in git pre-commit hook context",
      "Test with files that have no exportString field (e.g., baganator.ts)"
    ],
    "passes": true
  },
  {
    "category": "Infrastructure",
    "description": "Convert export tags and addon categories to TypeScript constants for better type safety and consistency",
    "details": "Replace string-based tags with typed constants exported from src/types/exports.ts. Create two 'as const' objects: (1) 'tag' object containing all tag constants (e.g., tag.ui, tag.nameplates, tag.pve, tag.mplus) and (2) 'category' object for addon categories (category.core, category.misc). Update AddonCategory interface to include optional category field. Benefits: autocomplete, typo prevention, refactoring safety, centralized tag vocabulary, clean import syntax (import { tag, category }), enables category-based filtering/grouping in UI.",
    "steps": [
      "Create 'tag' const object in src/types/exports.ts with all existing tags as properties (ui, nameplates, threat, pve, dmg, mplus, mythic, etc.) using 'as const' assertion",
      "Create 'category' const object with core and misc properties using 'as const' assertion",
      "Export AddonCategoryType = typeof category[keyof typeof category]",
      "Export TagType = typeof tag[keyof typeof tag]",
      "Add optional category?: AddonCategoryType field to AddonCategory interface",
      "Update AddonExport.tags type from string[] to TagType[]",
      "Migrate all data/exports/*.ts files to import { tag, category } and use tag.* constants instead of string literals",
      "Assign category field to each addon (determine core vs misc based on essentialness)",
      "Update any UI components that filter/display tags to use the new constants",
      "Verify TypeScript compilation passes with strict type checking",
      "Update AGENTS.md documentation to reflect new constant usage pattern"
    ],
    "passes": true
  },
  {
    "category": "Infrastructure",
    "description": "Simplify tag system from 91 tags to ~18 core tags and make category field required for all addons",
    "details": "Current tag system has 91 tags with many redundancies (dmg/damage, cd/cds/cdm, mythic/mythic+/m+, 8 resource types, weakaura - deprecated, etc). Simplify to ~18 functional tags: Combat (combat, damage, healing, meter), UI/Visual (ui, hud, frames, nameplates, healthbar), Resources (resource, cooldowns), Content (pve, raid, dungeon, mythic+), Utility (map, quest, misc). Keep raid and dungeon/mythic+ as separate tags for better filtering. Make category field required (not optional) in AddonCategory interface - all addons must be core or misc. Update all export files to use simplified tags.",
    "steps": [
      "Define simplified tag constants in src/types/exports.ts (~18 tags vs current 91)",
      "Create tag migration mapping (old tags → new tags) for reference",
      "Change category field from optional to required in AddonCategory interface",
      "Update all data/exports/*.ts files to use new simplified tags",
      "Ensure every addon has category field set (core or misc)",
      "Remove old unused tag constants from exports.ts",
      "Update AGENTS.md documentation with new simplified tag list",
      "Verify TypeScript compilation passes",
      "Test UI components that display/filter tags work correctly"
    ],
    "passes": true
  }
]
